# Anchor3D

Representation of Anchor 3D in IDEA StatiCa Detail

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**id** | **int** | Element Id | [optional]

## Example

```python
from ideastatica_rcs_api.models.anchor3_d import Anchor3D

# TODO update the JSON string below
json = "{}"
# create an instance of Anchor3D from a JSON string
anchor3_d_instance = Anchor3D.from_json(json)
# print the JSON string representation of the object
print(Anchor3D.to_json())

# convert the object into a dict
anchor3_d_dict = anchor3_d_instance.to_dict()
# create an instance of Anchor3D from a dict
anchor3_d_from_dict = Anchor3D.from_dict(anchor3_d_dict)
```
[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)